### Pandas Practice Test - FirstName LastName
1. Change FirstName and LastName to your name (for both notebook name and title),
2. Answer each question inside the cell under # Insert answer here",
3. After you answer all questions, Restart Kernel and Run All Cells,
4. Download an HTML version of your completed Notebook,
5. Only questions # 8, 11, 12, 13 do not need codes. All other cells need your codes. 
6. Submit completed test via Canvas Submission window.

In [2]:
# 1. import libraries (both numpy and pandas)
import numpy as np
import pandas as pd

In [3]:
# 2. load the mortality_data and name it df
df = pd.read_csv('mortality_data.csv')

In [4]:
# 3. create a copy of df and name it mortality
mortality = df.copy()

In [5]:
# 4. display the first 8 rows of mortality dataset
(mortality.head(8))

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5
5  1905  1-4 Years      1498.9
6  1906  1-4 Years      1580.0
7  1907  1-4 Years      1468.3

In [6]:
# 5. dispaly the last 5 rows of mortality dataset
(mortality.tail(5))

     Year    Age Group  Death Rate
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

In [7]:
# 6. display 5 attributs of mortality dataset

(mortality.iloc[:, :5].head())

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [8]:
# 7. display more information about the mortality dataset

(mortality.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        476 non-null    int64
 1   Age Group   476 non-null    object
 2   Death Rate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

In [9]:
(mortality.describe())

              Year   Death Rate
count   476.000000   476.000000
mean   1959.000000   192.924160
std      34.387268   293.224216
min    1900.000000    11.400000
25%    1929.000000    40.575000
50%    1959.000000    89.500000
75%    1989.000000   222.575000
max    2018.000000  1983.800000

In [10]:
(mortality.head())

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [11]:
# 8. is there any missing values in the mortality dataset? 
# answer here: No

missing_values = mortality.isnull().sum()

print("Missing values in each column:")
(missing_values)

Missing values in each column:

Year          0
Age Group     0
Death Rate    0
dtype: int64

In [12]:
# 9. What are the dtypes in the mortality dataset? show your code.
mortality.dtypes

Year            int64
Age Group      object
Death Rate    float64
dtype: object

In [13]:
# 10. display the statistical summary of the mortality dataset and transpose the output

summary = mortality.describe().transpose()
summary

,count,mean,std,min,25%,50%,75%,max
Year,476.0,1959.00000,34.387268,1900.0,1929.000,1959.0,1989.000,2018.0
Death Rate,476.0,192.92416,293.224216,11.4,40.575,89.5,222.575,1983.8

In [14]:
# 11. what is the range of years (earliest and lastest years) in the mortality dataset?
# answer here: earliest year 1900.0 and maximum year is 2018.0


# Find the range of years (earliest and latest years) in the mortality dataset


earliest_year = df['Year'].min()
latest_year = df['Year'].max()

In [15]:
# 12. what are the minimum, and maximum of death rate in the mortality dataset?
# answer here:
min_death_rate = mortality['Death Rate'].min()
max_death_rate = mortality['Death Rate'].max()

(f"The minimum death rate in the mortality dataset is {min_death_rate}.")
(f"The maximum death rate in the mortality dataset is {max_death_rate}.")

'The maximum death rate in the mortality dataset is 1983.8.'

In [16]:
# 13. what are the the average and the median of death rate in the mortality dataset?
# answer here:
average_death_rate = mortality['Death Rate'].mean()
median_death_rate = mortality['Death Rate'].median()    

(f"The average death rate in the mortality dataset is {average_death_rate}.")
(f"The median death rate in the mortality dataset is {median_death_rate}.")

'The median death rate in the mortality dataset is 89.5.'

In [17]:
# 14. create a dataframe using a numpy array with 5 rows and 3 columns
# name the columns: 'Age', 'Education', 'Income'
# name the rows (the index): 'No-Experience', 'Entry-Level', 'Experienced', 'Expert', 'Senior'


data = np.array([
    [25, 12, 50000],
    [30, 14, 60000],
    [35, 16, 70000],
    [40, 18, 80000],
    [45, 20, 90000]
])


df = pd.DataFrame(data, columns=['Age', 'Education', 'Income'], index=['No-Experience', 'Entry-Level', 'Experienced', 'Expert', 'Senior'])


(df)

               Age  Education  Income
No-Experience   25         12   50000
Entry-Level     30         14   60000
Experienced     35         16   70000
Expert          40         18   80000
Senior          45         20   90000

### End of Pandas Test.